# =============================================================================
# Переменные для подключения к Yandex Cloud
# =============================================================================

variable "cloud_id" {
  description = "ID облака Yandex Cloud"
  type        = string
}

variable "folder_id" {
  description = "ID каталога Yandex Cloud"
  type        = string
}

# =============================================================================
# Опциональные переменные с дефолтными значениями
# =============================================================================

variable "region" {
  description = "Регион Yandex Cloud"
  type        = string
  default     = "ru-central1"
}
